<?php
/*
$cfg_order_type = array(0=>'域名新购', 1=>'网址新购', 2=>'域名续费', 3=>'网址续费', 4=>'域名转出', 5=>'网址转出', 6=>'域名转入',
						7=>'网址转入', 8=>'域名过户', 9=>'网址过户', 10=>'信息修改', 11=>'证书索取', 12=>'主机新购', 13=>'主机续费',
						14=>'主机增容', 15=>'数据库新购', 16=>'数据库续费', 17=>'数据库增容', 18=>'263企业邮局新购', 19=>'微软邮新购',
						20=>'263企业邮局续费', 21=>'微软邮续费', 22=>'263企业邮局增购', 23=>'微软邮增购', 24=>'建站易新购', 25=>'挖宝易新购',
						26=>'建站易续费', 27=>'挖宝易续费', 28=>'无线网址短信充值业务', 29=>'预存充值', 30=>'提取现金', 31=>'提交意向',
						32=>'虚拟主机域名绑定', 33=>'建站易域名绑定', 34=>'发票索取', 35=>'建站易增容', 36=>'挖宝易增容', 37=>'网络推广', 
						38=>'B2B营销', 39=>'网站认证', 40=>'知识产权');
*/
						
$cfg_order_type = array(0=>'新购', 1=>'续费', 2=>'信息修改', 3=>'转出', 4=>'转入', 5=>'过户', 6=>'证书索取', 7=>'帐户充值', 8=>'帐户提现', 9=>'发票索取', 10=>'增容', 11=>'域名绑定', 12=>'退款单', 13=>'无线网址短信充值', 14=>'增购');
						
						
$cfg_order_status = array(0=>'新订单', 1=>'已取消', 2=>'审核中', 3=>'资料异常', 4=>'业务处理中', 5=>'处理中', 6=>'业务异常', 7=>'财务异常', 8=>'已作废', 9=>'部分完成', 10=>'已完成', 11=>'已确认');

//设计不合理，会严重影响财务统计 已废除$cfg_pay_status = array(0=>'——', 1=>'未付款', 2=>'待收款', 3=>'已收款', 4=>'待退款', 5=>'已退款', 6=>'已转账', 7=>'未转账');
$cfg_member_type= array(1=>'个人', 2=>'单位' );
$cfg_pay_status = array(0=>'未付款',1=>'已付款',2=>'免费');
$cfg_refund_status = array(0=>'无退款',1=>'待退款',2=>'已退款');
$cfg_pay_type = array('prepay' => '0', 'alipay' => '1','bankpay' => '2');
$cfg_order_pay_type = array( 0=>'预付款',1=>'支付宝', 2=>'银行汇款' );
$cfg_order_refund_type = array( 0=>'退到帐户余额',1=>'退到支付宝', 2=>'退到银行账户' );
$cfg_order_source = array(0=>'前台订单', 1=>'后台订单');
//$cfg_option_status = array(0=>'待处理', 1=>'已处理'); //0 1用于注册部问题业务，, 4=>'未寄送', 5=>'已寄送'4 5用于客服部发票业务
$cfg_invoice_status=array(0=>'等待处理',1=>'已开票',2=>'已取消');//发票状态
$cfg_visit_status = array(0=>'不用回访', 1=>'待回访'); //用于客服部回访业务
$cfg_visit_type = array( 0=>'到款异常', 1=>'资料异常', 2=>'业务异常', 3=>'退款异常');
//$cfg_buy_status = array(0=>'正常', 1=>'暂停', 2=>'催费', 3=>'过期');
$cfg_buy_status = array(0=>'未生效', 1=>'正常', 2=>'催费', 3=>'过期'); //产品状态
$cfg_buy_preaudit = array(0=>'不需要', 1=>'待审', 2=>'通过'); //预审状态
$cfg_buy_audit = array(0=>'不需要', 1=>'待审', 2=>'通过'); //复审状态
$cfg_buy_visit = array(0=>'没有问题', 1=>'存在问题'); //异常状态
$cfg_is_renew = array(0=>'未设置', 1=>'已设置');   //自动续费状态
$cfg_WlkType = array("1"=>"行业网址", "2"=>"普通网址","3"=>"精品网址");  //无线网址类型
$cfg_RnType=array("normal"=>"普通通用网址","normalgeneral"=>"普通通用词","zhungeneral"=>"准通用词","goldgeneral"=>"白金通用词","limit"=>"限制注册","prohibit"=>"禁止注册",);  //通用网址类型
$cfg_ask_type = array(1=>'财务类', 2=>'技术类', 3=>'域名/网址类', 4=>'虚拟主机类',5=>'邮局类',6=>'网站类',7=>'网站认证类',8=>'网络推广类',9=>'知识产权类',10=>'B2B营销类',11=>'其它类');   //在线提问类别
$cfg_is_read = array(0=>'未读', 1=>'已读');    //消息中心状态  0为未读，1为已读
//$cfg_buy_type= array(0=>'支付', 1=>'充值', 2=>'退款', 3=>'提现');  //交易类型
$cfg_trans_inout= array(0=>'收入', 1=>'支出');  //交易类型
$cfg_papers_type = array('I1' => '身份证', 'I2' => '军官证', 'I3' => '护照', 'E1' => '营业执照', 'E2' => '组织机构代码证','B1' => '港澳台身份证','B2' => '警察身份证','B3' => '临时身份证','B4' => '户口卡'); //证件类型
$cfg_data_type=array('D1' => '营业执照','D2' => '个体营业执照','D3' => '组织机构代码证');//可信申请资料类型
$cfg_industry_type=array('0' =>'计算机硬件、软件','1' =>'互联网、IT服务','2' =>'综合类、新闻类','3' =>'金融、证券、银行、基金、投资','4' =>'保险','5' =>'电子商务','6' =>'网络游戏','7' =>'电子、通讯','8' =>'工业、自动化','9' =>'房地产、建筑、装潢','10' =>'广告、公关、市场推广','11' =>'媒体、影视、文化、艺术','12' =>'教育、培训','13' =>'医药、医疗机构','14' =>'酒店、餐饮','15' =>'旅游、度假、休闲','16' =>'消费品（服装、食品等）','17' =>'生物、化工','18' =>'物流、邮政','19' =>'航空、航天','20' =>'其它');

$cfg_option_button = array(0=>'已收款', 1=>'待回访', 2=>'已完成', 3=>'已退款', 4=>'取消待退款', 5=>'已开票', 6=>'取消开票', 7=>'有问题', 8=>'已回访', 
						   9=>'待退款', 10=>'申请拆单', 11=>'取消订单', 12=>'待审核', 13=>'待原件', 14=>'审核通过', 15=>'处理中', 16=>'已寄送', 17=>'已处理', 
						   18=>'转入成功', 19=>'转入失败', 20=>'审核不通过', 21=>'无问题', 22=>'续费完成', 23=>'无需续费', 24=>'添加续费项目', 25=>'添加手续费项目', 
						   26=>'上传证书', 27=>'上传资料');  //操作的按钮
$cfg_industry = array(S1=>'party and government', S2=>'information and consulting services', S3=>'social services', S4=>'commerce and taxation', S5=>'sports and entertainment', S6=>'transportation', S7=>'news media and advertising', S8=>'business commerce', S9=>'scientific research and education', S10=>'eal estate', S11=>'postal service', S12=>'informat', S13=>'manufacturing', S14=>'public utility (water, electricity, gas etc)', S15=>'construction', S16=>'agriculture/forestry/fishery', S17=>'mining', S18=>'other');  //industry

//广告投放位置
$cfg_advertisement_arr = array(1=>'首页banner',2=>'首页中间1',3=>'首页中间2',4=>'域名注册banner',5=>'虚拟主机banner',6=>'邮局租用banner',7=>'网站建设banner',8=>'网站认证banner',9=>'网络推广banner',10=>'知识产权banner',11=>'B2Bbanner',12=>'关于互易banner',13=>'客户服务banner',14=>'常见问题banner',15=>'域名注册->网址查询',16=>'友情链接',17=>'资讯中心banner',18=>'支付页banner',19=>'意向申请页banner');

//广告类型
$cfg_advertisement_type=array(1=>'图片广告',2=>'Flash广告',3=>'文字广告');

//产品规格类型
$cfg_product_type = array(
	//域名
	'domain'=>'2,3',
	//通用网址
	'keyword'=>'5',
	//无线网址
	'wkkeyword'=>'4',
	//虚拟主机及数据库
	'hosting' => '6,22',
	//虚拟主机
	'host' => '6',
	//数据库
	'db' => '22',
	//邮局租用
	'postoffice' => '11',
	//网站建设
	'website' => '37'
	);

//产品接口
$cfg_product_interface = array(
	'HuyiDomain' => 'cnnic英文域名接口',
	'WebnicDomain' => 'webnic域名接口',
	'BuschinaDomain' => '商务中国域名接口',
	'GoDomain' => 'verisign域名接口',
	'HuyiZhongwen' => 'cnnic中文域名接口',
	'HuyiKeyword' => '通用网址接口',
	'WlkKeyword' => '无线网址接口'
);


?>