<?php
require("include/json.class.php");
$act=$_REQUEST["act"];
$json = new JSON();
if($act=="getdate"){
	$xlinfo = array(0=>array('question'=>'瞒天过海','opt1'=>'虚张声势，不予理会','opt2'=>'全军戒备，准备迎战','prize1'=>'银币+少量','prize2'=>'征收次数+1')
,1=>array('question'=>'围魏救赵','opt1'=>'按兵不动，静观其变','opt2'=>'主动出击，杀其先锋','prize1'=>'征收冷却-5','prize2'=>'银币+少量')
,2=>array('question'=>'借刀杀人','opt1'=>'妖言惑众，立即制止','opt2'=>'谋反投敌，给我拿下','prize1'=>'银币+少量','prize2'=>'征收冷却-5')
,3=>array('question'=>'以逸待劳','opt1'=>'立即撤离，避其锋芒','opt2'=>'休兵养性，以待一站','prize1'=>'征收次数+1','prize2'=>'银币+少量')
,4=>array('question'=>'趁火打劫','opt1'=>'按兵不动，静观其变','opt2'=>'主动出击，攻城略地','prize1'=>'征收冷却-5','prize2'=>'征收冷却-10')
,5=>array('question'=>'声东击西','opt1'=>'城东危险，速速出兵','opt2'=>'城西危险，戒备防御','prize1'=>'银币+少量','prize2'=>'征收次数+1')
,6=>array('question'=>'无中生有','opt1'=>'列阵布军，攻占敌军','opt2'=>'养兵围困，待其投降','prize1'=>'银币+少量','prize2'=>'征收冷却-10')
,7=>array('question'=>'暗渡陈仓','opt1'=>'按兵不动，静观其变','opt2'=>'列阵出兵，干扰敌军','prize1'=>'银币+少量','prize2'=>'征收冷却-10')
,8=>array('question'=>'隔岸观火','opt1'=>'按兵不动，静观其变','opt2'=>'主动出击，乘乱攻城','prize1'=>'征收冷却-10','prize2'=>'征收次数+1')
,9=>array('question'=>'笑里藏刀','opt1'=>'求才心切，收为己用','opt2'=>'天生反骨，推出斩首','prize1'=>'征收冷却-10','prize2'=>'银币+少量')
,10=>array('question'=>'李代桃僵','opt1'=>'按兵不动，静观其变','opt2'=>'汜水要塞，立即出兵','prize1'=>'少量银币','prize2'=>'征收冷却-20')
,11=>array('question'=>'顺手牵羊','opt1'=>'敌军不明，不可轻取','opt2'=>'败其士气，夺其粮仓','prize1'=>'征收次数+1','prize2'=>'征收冷却-20')
,12=>array('question'=>'打草惊蛇','opt1'=>'先锋探路，查其动向','opt2'=>'敌军倦怠，主动出击','prize1'=>'征收冷却-10','prize2'=>'银币+当前可征收数')
,13=>array('question'=>'借尸还魂','opt1'=>'大将虽伤，可用其名','opt2'=>'大将受伤，另立先锋','prize1'=>'银币+少量','prize2'=>'征收冷却-5')
,14=>array('question'=>'调虎离山','opt1'=>'城池戒备，不可轻动','opt2'=>'主动发兵，前去支援','prize1'=>'征收冷却-20','prize2'=>'银币+少量')
,15=>array('question'=>'欲擒故纵','opt1'=>'愚忠之人，推出斩首','opt2'=>'忠义之才，放他出吧','prize1'=>'征收冷却-20','prize2'=>'银币+少量')
,16=>array('question'=>'抛砖引玉','opt1'=>'平庸之辈，主动出击','opt2'=>'防其有变，试其锋芒','prize1'=>'银币+当前可征收数','prize2'=>'征收次数+1')
,17=>array('question'=>'擒贼擒王','opt1'=>'敌军不明，不可轻动','opt2'=>'天赐良机，速速出兵','prize1'=>'银币+少量','prize2'=>'征收次数+1')
,18=>array('question'=>'釜底抽薪','opt1'=>'围而不攻，断其粮草','opt2'=>'再次出兵，强攻城池','prize1'=>'征收冷却-20','prize2'=>'银币+少量')
,19=>array('question'=>'混水摸鱼','opt1'=>'出兵支援，得其利益','opt2'=>'按兵不动，静观其变','prize1'=>'征收冷却-10','prize2'=>'银币+少量')
,20=>array('question'=>'金蝉脱壳','opt1'=>'千军出击，侯军撤退','opt2'=>'全军戒备，准备迎战','prize1'=>'银币+当前可征收数','prize2'=>'银币+少量')
,21=>array('question'=>'关门捉贼','opt1'=>'乘胜追击，胜利在望','opt2'=>'恐有埋伏，穷寇莫追','prize1'=>'银币+少量','prize2'=>'征收次数+1')
,22=>array('question'=>'远交近攻','opt1'=>'兵分两路，同时制敌','opt2'=>'先交袁绍，后攻袁术','prize1'=>'征收次数+1','prize2'=>'征收冷却+5')
,23=>array('question'=>'假途伐虢','opt1'=>'黄金万两，借其无妨','opt2'=>'伏兵待命，奇袭刘表','prize1'=>'礼金+3','prize2'=>'征收次数+1')
,24=>array('question'=>'偷梁换柱','opt1'=>'敌军狡诈，不可轻动','opt2'=>'敌军无将，精锐出击','prize1'=>'征收次数+1','prize2'=>'银币+少量')
,25=>array('question'=>'指桑骂槐','opt1'=>'严整军纪，惩治守将','opt2'=>'如此放肆，推出斩首','prize1'=>'银币+少量','prize2'=>'银币+当前可征收数')
,26=>array('question'=>'假痴不颠','opt1'=>'关入军牢，观其言行','opt2'=>'痴呆疯子，推出斩首','prize1'=>'礼金+5','prize2'=>'银币+少量')
,27=>array('question'=>'上屋抽梯','opt1'=>'解困南城，出击刘璋','opt2'=>'按兵不动，静观其变','prize1'=>'银币+少量','prize2'=>'银币+当前可征收数')
,28=>array('question'=>'树上开花','opt1'=>'敌军不明，不可轻动','opt2'=>'虚张声势，主动出击','prize1'=>'征收冷却-30','prize2'=>'征收次数+1')
,29=>array('question'=>'反客为主','opt1'=>'能观时势，接受归降','opt2'=>'归降是假，偷袭是真','prize1'=>'征收次数+1','prize2'=>'银币+当前可征收数')
,30=>array('question'=>'美人计','opt1'=>'军纪如山，拒接美女','opt2'=>'如此美意，怎可拒绝','prize1'=>'银币+当前可征收数','prize2'=>'征收次数+1')
,31=>array('question'=>'空城计','opt1'=>'先锋探路，查其动向','opt2'=>'恐有埋伏，按兵不动','prize1'=>'银币+少量','prize2'=>'礼金+5')
,32=>array('question'=>'反间计','opt1'=>'谣言惑众，立即制止','opt2'=>'天生反骨，给我拿下','prize1'=>'征收冷却-5','prize2'=>'礼金+10')
,33=>array('question'=>'苦肉计','opt1'=>'先锋大将，为我所用','opt2'=>'天生反骨，推出斩首','prize1'=>'银币+当前可征收数','prize2'=>'征收冷却-30')
,34=>array('question'=>'连环计','opt1'=>'派出先锋，将其剿灭','opt2'=>'按兵不动，静观其变','prize1'=>'银币+少量','prize2'=>'银币+当前可征收数')
,35=>array('question'=>'走为上','opt1'=>'集中兵力，誓死守城','opt2'=>'立即撤军，避其锋芒','prize1'=>'银币+你当前征收数','prize2'=>'礼金+10')

	);

	$str = "{xlinfo:" . $json->encode($xlinfo). "}";
	exit($str);
	
}
?>